Repository: miurahr/translate-django-ja
Catalog: tm/django.tmx
Source language: en_us
Languages: ja

source: At this point, it's worth reviewing what these arguments are for.
ja: ``regex`` と ``view`` 、オプションで ``kwargs`` と ``name`` です。ここで引数が何のためにあるものかを見ておきましょう。

source: :func:`~django.conf.urls.url` argument: regex
ja: :func:`~django.conf.urls.url` 引数: regex

source: The term "regex" is a commonly used short form meaning "regular expression", which is a syntax for matching patterns in strings, or in this case, url patterns.
ja: "regex" という単語は省略形で、一般的に "regular expression" という意味があります。これは文字列にマッチするパターンの構文で、この場合はURLパターンにあたります。

source: Django starts at the first regular expression and makes its way down the list, comparing the requested URL against each regular expression until it finds one that matches.
ja: Django ははじめの正規表現から開始し、リストを順に下に見ていきます。リクエストされたURLと各正規表現を、マッチするものが見つかるまで比較します。

source: Note that these regular expressions do not search GET and POST parameters, or the domain name. For example, in a request to ``http://www.example.com/myapp/``, the URLconf will look for ``myapp/``. In a request to ``http://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
ja: これらの正規表現は GET, POST のパラメータや、ドメイン名からは検索しません。例えば ``http://www.example.com/myapp/`` へのリクエストでは、 URLconf は ``myapp/`` を見ます。 ``http://www.example.com/myapp/?page=3`` の場も同じく、 URLconf は ``myapp/`` を見ます。

source: If you need help with regular expressions, see `Wikipedia's entry`_ and the documentation of the :mod:`re` module. Also, the O'Reilly book "Mastering Regular Expressions" by Jeffrey Friedl is fantastic. In practice, however, you don't need to be an expert on regular expressions, as you really only need to know how to capture simple patterns. In fact, complex regexes can have poor lookup performance, so you probably shouldn't rely on the full power of regexes.
ja: 正規表現についてわからないことがあれば `Wikipediaのエントリー`_ と :mod:`re` モジュールのドキュメントを参照してください。オライリーから出版されている Jeffery Friendl の "Mastering Reglar Expressions" も参考になります。しかし実際問題としては、正規表現のエキスパートになる必要はありません。単純なパターンをキャプチャする方法を知っていれば十分です。それに複雑な正規表現はルックアップのパフォーマンスが悪いので、正規表現のフルパワーに依存するのはよくありません。

source: Finally, a performance note: these regular expressions are compiled the first time the URLconf module is loaded. They're super fast (as long as the lookups aren't too complex as noted above).
ja: パフォーマンスノート: 正規表現は URLconf モジュールが読み込まれた最初にコンパイルされるので、高速に動作します (先ほど述べたように複雑すぎない場合)。

source: :func:`~django.conf.urls.url` argument: view
ja: :func:`~django.conf.urls.url` 引数: view

source: When Django finds a regular expression match, Django calls the specified view function, with an :class:`~django.http.HttpRequest` object as the first argument and any “captured” values from the regular expression as other arguments. If the regex uses simple captures, values are passed as positional arguments; if it uses named captures, values are passed as keyword arguments. We'll give an example of this in a bit.
ja: Django がマッチする正規表現を見つけると、 Django は所定のビュー関数を呼び出します。その際は :class:`~django.http.HttpRequest` オブジェクトを第一引数に、その他、正規表現から「キャプチャされた」値を他の引数に関数を呼び出します。正規表現が単純にキャプチャをしている場合は位置引数として、名前付きでキャプチャしている場合はキーワード引数として呼び出します。少し例を提示します。

source: :func:`~django.conf.urls.url` argument: kwargs
ja: :func:`~django.conf.urls.url` 引数: kwargs

source: Arbitrary keyword arguments can be passed in a dictionary to the target view. We aren't going to use this feature of Django in the tutorial.
ja: 任意のキーワード引数を辞書として対象のビューに渡せます。この機能はチュートリアルでは使いません。

source: :func:`~django.conf.urls.url` argument: name
ja: :func:`~django.conf.urls.url` 引数: name

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django especially templates. This powerful feature allows you to make global changes to the url patterns of your project while only touching a single file.
ja: URL に名前付けをしておけば Django のどこからでも明確に参照できます。とくにテンプレートで有効です。この便利な機能のおかげで、プロジェクトのURLにグローバルな変更を加える場合にも1つのファイルを変更するだけで済むようになります。

source: Writing more views
ja: もっとビューを書いてみる

source: Now let's add a few more views to ``polls/views.py``. These views are slightly different, because they take an argument:
ja: それではもう少しviewを``polls/vies.py``に追加していきましょう。これから追加するviewでは引数をとります。

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.conf.urls.url` calls:
ja: 新しいviewを``polls.urls``に追加します。:func:`~django.conf.urls.url` 呼び出すview

source: Take a look in your browser, at "/polls/34/". It'll run the ``detail()`` method and display whatever ID you provide in the URL. Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
ja: お使いのブラウザで、 "/polls/34/" を見てください。 ``detail()`` メソッドが実行され、URLで提供したIDが表示されます。"/polls/34/results/" と "/polls/34/vote/" も試してください。結果と投票ページのプレースホルダがそれぞれ表示されます。

source: When somebody requests a page from your Web site -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the regular expressions in order. The :func:`~django.conf.urls.include` functions we are using simply reference other URLconfs. Note that the regular expressions for the :func:`~django.conf.urls.include` functions don't have a ``$`` (end-of-string match character) but rather a trailing slash. Whenever Django encounters :func:`~django.conf.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
ja: 誰かがWebサイトの "/polls/34/" をリクエストすると、 Django は :setting:`ROOT_URLCONF` に指定されている、 Python モジュール ``mysite.urls`` をロードします。そのモジュール内の ``urlpatterns`` という変数を探し、その中に入っている正規表現を順に検査してゆきます。:func:`~django.conf.urls.include` 関数は、単に他の URLconf の参照に使用します。 :func:`~django.conf.urls.include` 関数の正規表現は、 ``$``(終端マッチ文字) ではなく、スラッシュがあることに注意してください。 Django は func:`~django.conf.urls.include` を 見つけたとき、マッチした URL 一部を区切って、さらなる処理のために、インクルードした URLconf に残りの部分を送ります。

source: The idea behind :func:`~django.conf.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
ja: :func:`~django.conf.urls.include` の背景にある考えは、 URL のプラグ & プレイを簡単に作ることです。 polls には独自の URLconf (``polls/urls.py``) を持っているので、 "/polls/" 、 "/fun_polls/" や、 "/content/polls/" といった、どんなパスルート下にも置けて、どこに置いてもきちんと動作します。

source: Here's what happens if a user goes to "/polls/34/" in this system:
ja: このシステムでユーザが "/polls/34/" にアクセスすると、次のように処 理されます:

source: Django will find the match at ``'^polls/'``
ja: Django は ``'^polls/'`` へのマッチを検出します。

source: Then, Django will strip off the matching text (``"polls/"``) and send the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing which matches ``r'^(?P<question_id>[0-9]+)/$'`` resulting in a call to the ``detail()`` view like so::
ja: Django はマッチ部分のテキスト (``"polls/"``) を取り去り、残りのテキスト ``"34/"`` を 'polls.urls' という URLconf に送り、``r'^(?P<question_id>[0-9]+)/$'`` にマッチする処理をさらに行い、``detail()`` ビューが呼ばれます::

source: The ``question_id='34'`` part comes from ``(?P<question_id>[0-9]+)``. Using parentheses around a pattern "captures" the text matched by that pattern and sends it as an argument to the view function; ``?P<question_id>`` defines the name that will be used to identify the matched pattern; and ``[0-9]+`` is a regular expression to match a sequence of digits (i.e., a number).
ja: ``question_id='34'`` の部分は、 ``(?P<question_id>[0-9]+)`` から来ています。パターンの前後に括弧を使用すると、そのパターンにマッチしたテキストを "キャプチャ" し、ビュー関数の引数として、それを送信します。 ``?P<question_id>`` はマッチしたパターンを識別するために使用する名前を定義します。 ``[0-9]+`` は一桁以上の数字(すなわち、数)にマッチする正規表現です。

source: Because the URL patterns are regular expressions, there really is no limit on what you can do with them. And there's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
ja: URL パターンは正規表現であるため、正規表現で実現できる限り制限はありません。また、 ``.html`` のような文字列を URL に追加する必要もありません。ただし、次のようにすれば、表現できます::

source: But, don't do that. It's silly.
ja: とはいえ、こんな阿呆なことはやめましょう。

source: Write views that actually do something
ja: 実際に動作するビューを書く

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`. The rest is up to you.
ja: 各ビューには二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :exc:`~django.http.Http404` のような例外の送出です。それ以外の処理はユーザ次第です。

source: Your view can read records from a database, or not. It can use a template system such as Django's -- or a third-party Python template system -- or not. It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
ja: ビューはデータベースからレコードを読みだしても、読み出さなくてもかまいません。 Django のテンプレートシステム、あるいはサードパーティの Python テンプ レートシステムを使ってもよいですし、使わなくてもかまいません。 PDF ファイルを生成しても、 XML を出力しても、 ZIP ファイルをその場で生成してもかまいません。 Python ライブラリを使ってやりたいことを何でも実現できます。

source: All Django wants is that :class:`~django.http.HttpResponse`. Or an exception.
ja: Django にとって必要なのは :class:`~django.http.HttpResponse` か、あるいは例外です。

source: Writing your first Django app, part 4
ja: はじめての Django アプリ作成、その 4

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
ja: このチュートリアルは :doc:`チュートリアルその 3 </intro/tutorial03>` の続きです。ここでは、引続き Web 投票アプリケーションの開発を例にして、簡単なフォー ム処理とコードの縮小化を中心に解説します。

source: Write a simple form
ja: 簡単なフォームを書く

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
ja: それでは、前回のチュートリアルで作成した投票詳細テンプレート ("polls/detail.html") を更新して、HTML の ``<form>`` 要素を入れましょう。

source: A quick rundown:
ja: 簡単に説明:

source: The above template displays a radio button for each question choice. The ``value`` of each radio button is the associated question choice's ID. The ``name`` of each radio button is ``"choice"``. That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=#`` where # is the ID of the selected choice. This is the basic concept of HTML forms.
ja: 上のテンプレートは、各質問の選択肢のラジオボタンが表示されます。各ラジオボタンの ``value`` は、関連する質問の選択肢のIDです。各ラジオボタンの ``name`` は ``"choice"`` です。投票者がラジオボタンの1つを選択し、フォームを送信する場合には、POSTデータ ``choice=#`` を送信します。＃の場所には選択肢のIDが入ります。これは、HTMLフォームの基本的な概念です。

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's just good Web development practice.
ja: フォームの ``action`` を ``{% url 'polls:vote' question.id %}`` に設定し、 さらに、 ``method="post"`` を設定します。``method="post"`` を使用する (``method="get"`` ではなく) ことは非常に重要です。なぜなら、フォームの送信はサーバ側のデータの更新につながるからです。サーバ側のデータを更新するフォームを作成する場合は、 ``method="post"`` を使いましょう。これは、 Django 固有のものではなく、いわば Web 開発の王道です。

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
ja: ``forloop.counter`` は、ttag:`for` タグのループが何度実行されたかを表す値です。

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
ja: POST フォーム(データを改ざんされる恐れのある) を作成しているので、クロス サイトリクエストフォージェリを心配する必要があります。ありがたいことに、 Django がこれに対応するとても使いやすい仕組みを提供してくれているので、あまり心配する必要はありません。手短に言うと、全ての自サイトへの POST フォームに、 :ttag:`{% csrf_token %}<csrf_token>` テンプレートタグを使います。

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line:
ja: 送信されたデータを処理するための Django のビューを作成しましょう。:doc:`チュートリアルその 3 </intro/tutorial03>` で、以下のような投票アプリケーションの URLconf を作成したことを思い出しましょう:

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``:
ja: すでに、 ``vote()`` 関数のダミー実装を作成しました。今度は、本物を実装しましょう。以下を ``polls/views.py`` に追加してください:

source: This code includes a few things we haven't covered yet in this tutorial:
ja: このコードには、これまでのチュートリアルで扱っていなかったことがいくつか入っています:

source: Writing your first Django app, part 5
ja: はじめての Django アプリ作成、その 5

source: This tutorial begins where :doc:`Tutorial 4 </intro/tutorial04>` left off. We've built a Web-poll application, and we'll now create some automated tests for it.
ja: このチュートリアルは :doc:`チュートリアル 4 </intro/tutorial04>` の続きです。Web 投票アプリケーションが完成したので、今度は自動テストを作ってみましょう。

source: Introducing automated testing
ja: 自動テストの導入

source: What are automated tests?
ja: 自動テストとは何ですか？

source: Tests are simple routines that check the operation of your code.
ja: テストとは単純なプログラムで、あなたのコードの動作を確認します。

source: What's different in *automated* tests is that the testing work is done for you by the system. You create a set of tests once, and then as you make changes to your app, you can check that your code still works as you originally intended, without having to perform time consuming manual testing.
ja: *自動* テストが他と異なる点は、テスト作業がシステムによって実行されることです。一度テストセットを作成すると、それからはアプリに変更を加えるたびに、あなたの意図した通りにコードが動作するか確認できます。手動でテストする時間がかかることはありません。

source: Why you need to create tests
ja: なぜテストを作成せねばならないのか

source: So why create tests, and why now?
ja: どうしてテストを作るのか？また、なぜ今なのか？

source: Tests will save you time
ja: テストはあなたの時間を節約します

source: Up to a certain point, 'checking that it seems to work' will be a satisfactory test. In a more sophisticated application, you might have dozens of complex interactions between components.
ja: ある一定の基準まで、'動くであろうことを確認すること'が十分なテストでしょう。高機能なアプリケーションでは、コンポーネント間で複雑な連携が数多くあるかもしれません。

source: Basic testing strategies
ja: 基本的なテスト方針

source: Writing your first Django app, part 6
ja: はじめての Django アプリ作成、その 6

source: This tutorial begins where :doc:`Tutorial 5 </intro/tutorial05>` left off. We've built a tested Web-poll application, and we'll now add a stylesheet and an image.
ja: このチュートリアルは :doc:`チュートリアル 5 </intro/tutorial05>` の続きです。Web 投票アプリケーションのテストが完成したので、今度はスタイルシートや画像を追加しましょう。

source: Aside from the HTML generated by the server, web applications generally need to serve additional files — such as images, JavaScript, or CSS — necessary to render the complete web page. In Django, we refer to these files as "static files".
ja: サーバで生成するHTML以外に、Webアプリケーションは一般的に完全なWebページをレンダリングするために、画像、JavaScript、CSSなど必要なファイルを提供する必要があります。Djangoでは、これらのファイルを "静的ファイル" と呼びます。

source: For small projects, this isn't a big deal, because you can just keep the static files somewhere your web server can find it.
ja: 小さなプロジェクトではこのことは大きな問題になりません。

source: However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
ja: Web サーバが見つけられる場所で静的ファイルを単に管理することができるからです。しかし、もっと大きな プロジェクトで、特に複数のアプリケーションからなる場合は、各アプリケーションが 持っている静的ファイルの集まりを複数扱うことになり、ややこしくなってきます。

source: That's what ``django.contrib.staticfiles`` is for: it collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
ja: ``django.contrib.staticfiles`` はまさにそのためにあります。これは静的なファイ ルを各アプリケーションから (さらに指定した別の場所からも) 一つの場所に集め、運用環境で公開しやすくするものです。

source: Customize your *app's* look and feel
ja: *アプリ* の構造をカスタマイズする

source: First, create a directory called ``static`` in your ``polls`` directory. Django will look for static files there, similarly to how Django finds templates inside ``polls/templates/``.
ja: 最初に、 ``polls`` ディレクトリの中に、 ``static`` ディレクトリを作成します。Django はそこから静的ファイルを探します。Django が ``polls/templates/`` からテンプレートを探す方法と同様です。

source: Static file namespacing
ja: 静的ファイルの名前空間

source: Put the following code in that stylesheet (``polls/static/polls/style.css``):
ja: スタイルシートに次のコードを配置します (``polls/static/polls/style.css``):

source: Next, add the following at the top of ``polls/templates/polls/index.html``:
ja: 次に、``polls/templates/polls/index.html`` の上部に追加します:
